{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "registered_name": null, "name": "input_2", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "registered_name": null, "name": "input_3", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "registered_name": null, "name": "input_4", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "registered_name": null, "name": "input_5", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "registered_name": null, "name": "input_6", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "registered_name": null, "name": "input_7", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "registered_name": null, "name": "input_8", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "registered_name": null, "name": "input_9", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "registered_name": null, "name": "input_10", "inbound_nodes": []}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_2", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_2", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_3", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_3", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_4", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_4", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_5", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_5", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_6", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_6", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_7", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_7", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_8", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_8", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_9", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_9", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d", "inbound_nodes": [[["tcn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_1", "inbound_nodes": [[["tcn_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_2", "inbound_nodes": [[["tcn_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_3", "inbound_nodes": [[["tcn_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_4", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_4", "inbound_nodes": [[["tcn_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_5", "inbound_nodes": [[["tcn_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_6", "inbound_nodes": [[["tcn_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_7", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_7", "inbound_nodes": [[["tcn_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_8", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_8", "inbound_nodes": [[["tcn_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_9", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_9", "inbound_nodes": [[["tcn_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_2", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_3", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_4", "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_5", "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_6", "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_7", "inbound_nodes": [[["max_pooling1d_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_8", "inbound_nodes": [[["max_pooling1d_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_9", "inbound_nodes": [[["max_pooling1d_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention", "inbound_nodes": [[["batch_normalization", 0, 0, {"value": ["batch_normalization", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_1", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {"value": ["batch_normalization_1", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_2", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {"value": ["batch_normalization_2", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_3", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {"value": ["batch_normalization_3", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_4", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {"value": ["batch_normalization_4", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_5", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {"value": ["batch_normalization_5", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_6", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {"value": ["batch_normalization_6", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_7", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {"value": ["batch_normalization_7", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_8", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {"value": ["batch_normalization_8", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_9", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {"value": ["batch_normalization_9", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32]]}, "name": "concatenate", "inbound_nodes": [[["multi_head_attention", 0, 0, {}], ["multi_head_attention_1", 0, 0, {}], ["multi_head_attention_2", 0, 0, {}], ["multi_head_attention_3", 0, 0, {}], ["multi_head_attention_4", 0, 0, {}], ["multi_head_attention_5", 0, 0, {}], ["multi_head_attention_6", 0, 0, {}], ["multi_head_attention_7", 0, 0, {}], ["multi_head_attention_8", 0, 0, {}], ["multi_head_attention_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 320]}, "name": "conv1d", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 64]}, "name": "max_pooling1d_10", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 125, 64]}, "name": "global_average_pooling1d", "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense", "inbound_nodes": [[["global_average_pooling1d", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0], ["input_9", 0, 0], ["input_10", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}