{"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_19"}, "registered_name": null, "name": "input_19", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_20"}, "registered_name": null, "name": "input_20", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_21"}, "registered_name": null, "name": "input_21", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_22"}, "registered_name": null, "name": "input_22", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_23"}, "registered_name": null, "name": "input_23", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_24"}, "registered_name": null, "name": "input_24", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_25"}, "registered_name": null, "name": "input_25", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_26"}, "registered_name": null, "name": "input_26", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_27"}, "registered_name": null, "name": "input_27", "inbound_nodes": []}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_18", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_18", "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_19", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_19", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_20", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_20", "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_21", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_21", "inbound_nodes": [[["input_22", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_22", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_22", "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_23", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_23", "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_24", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_24", "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_25", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_25", "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_26", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_26", "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_20", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_20", "inbound_nodes": [[["tcn_18", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_21", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_21", "inbound_nodes": [[["tcn_19", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_22", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_22", "inbound_nodes": [[["tcn_20", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_23", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_23", "inbound_nodes": [[["tcn_21", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_24", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_24", "inbound_nodes": [[["tcn_22", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_25", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_25", "inbound_nodes": [[["tcn_23", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_26", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_26", "inbound_nodes": [[["tcn_24", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_27", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_27", "inbound_nodes": [[["tcn_25", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_28", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_28", "inbound_nodes": [[["tcn_26", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_18", "inbound_nodes": [[["max_pooling1d_20", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_19", "inbound_nodes": [[["max_pooling1d_21", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_20", "inbound_nodes": [[["max_pooling1d_22", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_21", "inbound_nodes": [[["max_pooling1d_23", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_22", "inbound_nodes": [[["max_pooling1d_24", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_23", "inbound_nodes": [[["max_pooling1d_25", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_24", "inbound_nodes": [[["max_pooling1d_26", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_25", "inbound_nodes": [[["max_pooling1d_27", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_26", "inbound_nodes": [[["max_pooling1d_28", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_18", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {"value": ["batch_normalization_18", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_19", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {"value": ["batch_normalization_19", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_20", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {"value": ["batch_normalization_20", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_21", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {"value": ["batch_normalization_21", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_22", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {"value": ["batch_normalization_22", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_23", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {"value": ["batch_normalization_23", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_24", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {"value": ["batch_normalization_24", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_25", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {"value": ["batch_normalization_25", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_26", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {"value": ["batch_normalization_26", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32]]}, "name": "concatenate_2", "inbound_nodes": [[["multi_head_attention_18", 0, 0, {}], ["multi_head_attention_19", 0, 0, {}], ["multi_head_attention_20", 0, 0, {}], ["multi_head_attention_21", 0, 0, {}], ["multi_head_attention_22", 0, 0, {}], ["multi_head_attention_23", 0, 0, {}], ["multi_head_attention_24", 0, 0, {}], ["multi_head_attention_25", 0, 0, {}], ["multi_head_attention_26", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 288]}, "name": "conv1d_2", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_29", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 64]}, "name": "max_pooling1d_29", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 125, 64]}, "name": "global_average_pooling1d_2", "inbound_nodes": [[["max_pooling1d_29", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_2", "inbound_nodes": [[["global_average_pooling1d_2", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0], ["input_21", 0, 0], ["input_22", 0, 0], ["input_23", 0, 0], ["input_24", 0, 0], ["input_25", 0, 0], ["input_26", 0, 0], ["input_27", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}