{"class_name": "Functional", "config": {"name": "model_5", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_51"}, "registered_name": null, "name": "input_51", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_52"}, "registered_name": null, "name": "input_52", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_53"}, "registered_name": null, "name": "input_53", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_54"}, "registered_name": null, "name": "input_54", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_55"}, "registered_name": null, "name": "input_55", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_56"}, "registered_name": null, "name": "input_56", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_57"}, "registered_name": null, "name": "input_57", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_58"}, "registered_name": null, "name": "input_58", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_59"}, "registered_name": null, "name": "input_59", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_60"}, "registered_name": null, "name": "input_60", "inbound_nodes": []}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_50", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_50", "inbound_nodes": [[["input_51", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_51", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_51", "inbound_nodes": [[["input_52", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_52", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_52", "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_53", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_53", "inbound_nodes": [[["input_54", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_54", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_54", "inbound_nodes": [[["input_55", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_55", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_55", "inbound_nodes": [[["input_56", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_56", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_56", "inbound_nodes": [[["input_57", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_57", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_57", "inbound_nodes": [[["input_58", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_58", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_58", "inbound_nodes": [[["input_59", 0, 0, {}]]]}, {"module": "tcn.tcn", "class_name": "TCN", "config": {"name": "tcn_59", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 1], "nb_filters": 32, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "registered_name": "TCN", "build_config": {"input_shape": [null, 500, 1]}, "name": "tcn_59", "inbound_nodes": [[["input_60", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_55", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_55", "inbound_nodes": [[["tcn_50", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_56", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_56", "inbound_nodes": [[["tcn_51", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_57", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_57", "inbound_nodes": [[["tcn_52", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_58", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_58", "inbound_nodes": [[["tcn_53", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_59", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_59", "inbound_nodes": [[["tcn_54", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_60", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_60", "inbound_nodes": [[["tcn_55", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_61", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_61", "inbound_nodes": [[["tcn_56", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_62", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_62", "inbound_nodes": [[["tcn_57", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_63", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_63", "inbound_nodes": [[["tcn_58", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_64", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 32]}, "name": "max_pooling1d_64", "inbound_nodes": [[["tcn_59", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_50", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_50", "inbound_nodes": [[["max_pooling1d_55", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_51", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_51", "inbound_nodes": [[["max_pooling1d_56", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_52", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_52", "inbound_nodes": [[["max_pooling1d_57", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_53", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_53", "inbound_nodes": [[["max_pooling1d_58", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_54", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_54", "inbound_nodes": [[["max_pooling1d_59", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_55", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_55", "inbound_nodes": [[["max_pooling1d_60", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_56", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_56", "inbound_nodes": [[["max_pooling1d_61", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_57", "inbound_nodes": [[["max_pooling1d_62", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_58", "inbound_nodes": [[["max_pooling1d_63", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_59", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "batch_normalization_59", "inbound_nodes": [[["max_pooling1d_64", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_50", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_50", "inbound_nodes": [[["batch_normalization_50", 0, 0, {"value": ["batch_normalization_50", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_51", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_51", "inbound_nodes": [[["batch_normalization_51", 0, 0, {"value": ["batch_normalization_51", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_52", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_52", "inbound_nodes": [[["batch_normalization_52", 0, 0, {"value": ["batch_normalization_52", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_53", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_53", "inbound_nodes": [[["batch_normalization_53", 0, 0, {"value": ["batch_normalization_53", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_54", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_54", "inbound_nodes": [[["batch_normalization_54", 0, 0, {"value": ["batch_normalization_54", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_55", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_55", "inbound_nodes": [[["batch_normalization_55", 0, 0, {"value": ["batch_normalization_55", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_56", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_56", "inbound_nodes": [[["batch_normalization_56", 0, 0, {"value": ["batch_normalization_56", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_57", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_57", "inbound_nodes": [[["batch_normalization_57", 0, 0, {"value": ["batch_normalization_57", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_58", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_58", "inbound_nodes": [[["batch_normalization_58", 0, 0, {"value": ["batch_normalization_58", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_59", "trainable": true, "dtype": "float32", "num_heads": 1, "key_dim": 4, "value_dim": 4, "dropout": 0.25, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 250, 32], "key_shape": [null, 250, 32], "value_shape": [null, 250, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 250, 32]}, "name": "multi_head_attention_59", "inbound_nodes": [[["batch_normalization_59", 0, 0, {"value": ["batch_normalization_59", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32], [null, 250, 32]]}, "name": "concatenate_5", "inbound_nodes": [[["multi_head_attention_50", 0, 0, {}], ["multi_head_attention_51", 0, 0, {}], ["multi_head_attention_52", 0, 0, {}], ["multi_head_attention_53", 0, 0, {}], ["multi_head_attention_54", 0, 0, {}], ["multi_head_attention_55", 0, 0, {}], ["multi_head_attention_56", 0, 0, {}], ["multi_head_attention_57", 0, 0, {}], ["multi_head_attention_58", 0, 0, {}], ["multi_head_attention_59", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 320]}, "name": "conv1d_5", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_65", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 64]}, "name": "max_pooling1d_65", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_5", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 125, 64]}, "name": "global_average_pooling1d_5", "inbound_nodes": [[["max_pooling1d_65", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_5", "inbound_nodes": [[["global_average_pooling1d_5", 0, 0, {}]]]}], "input_layers": [["input_51", 0, 0], ["input_52", 0, 0], ["input_53", 0, 0], ["input_54", 0, 0], ["input_55", 0, 0], ["input_56", 0, 0], ["input_57", 0, 0], ["input_58", 0, 0], ["input_59", 0, 0], ["input_60", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}